Revit 2027 API
FailureDefinition.HasResolutions Method
 Checks if the FailureDefinition has at least one resolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasResolutions()
Public Function HasResolutions As Boolean
public:
bool HasResolutions()
member HasResolutions : unit -> bool
Return Value
Boolean
 True if at least one resolution is defined in the FailureDefinition.
See Also
Reference
FailureDefinition Class
Autodesk.Revit.DB Namespace